.config/doom/config.org
#+TITLE: Chu's Literate DOOM GNU Emacs Configuration
#+AUTHOR: chu the pup
#+DESCRIPTION: Chu's Literate Doom GNU Emacs configuration
#+PROPERTY: header-args :tangle yes
#+auto_tangle: t
* table of contents :toc:
- [[#preamble][Preamble]]
  - [[#org-mode-babel-tangle-setup][Org-mode babel tangle setup]]
  - [[#usage-of-quote-and-example-blocks][Usage of quote and example blocks]]
- [[#doom-emacs-documentation][DOOM Emacs Documentation]]
- [[#config][config]]
  - [[#private-configuration][private configuration]]
  - [[#abbrev-mode][abbrev mode]]
  - [[#dictionary][dictionary]]
  - [[#vale][vale]]
  - [[#palimpsest-prog-mode-hook][palimpsest prog mode hook]]
  - [[#vulpea-autosync-org-roam-todos-from-dailies][vulpea autosync org roam todos from dailies]]
  - [[#auth-source-save-behavior][auth source save behavior]]
  - [[#emms][EMMS]]
  - [[#irc-erc][IRC (ERC)]]
  - [[#dired-director-editor-emacs-file-manager-settings][Dired director editor (Emacs file manager) settings]]
  - [[#trash-instead-of-delete][Trash instead of delete]]
  - [[#org-mode][Org-Mode]]
  - [[#visual-changes][Visual Changes]]
  - [[#ripgrep-rg-fast-search-to-handle-projectile-project-files][ripgrep "rg" fast search to handle projectile project files]]
  - [[#enable-active-presence-on-discord-for-emacs][Enable active presence on Discord for Emacs]]
  - [[#epg-letting-emacs-query-for-gpg-passwords][EPG: Letting Emacs query for GPG passwords]]
  - [[#tramp-ftp-doesnt-read-my-authinfogpg][Tramp FTP doesn't read my ~/.authinfo.gpg]]
  - [[#achievements-in-emacs][Achievements in Emacs]]
  - [[#round-numbers-to-n-decimals-in-elisp][Round numbers to N decimals in Elisp]]
  - [[#alpha-background-transparency-function][Alpha background transparency function]]
  - [[#fix-alpha-transparency-issues][Fix alpha transparency issues]]
  - [[#inhibit-xresources-being-loaded-by-emacs][Inhibit Xresources being loaded by Emacs]]
  - [[#literate-calc-mode][literate calc mode]]
  - [[#common-lisp-find-file-fix-for-roswell-compatibility][common lisp find file fix for roswell compatibility]]
  - [[#roswell-lisp-sly-helper][roswell lisp sly helper]]
  - [[#common-lisp-snippets-for-yasnippets-require][common lisp snippets for yasnippets (require)]]
  - [[#dired-rsync][dired-rsync]]
- [[#works-cited][Works Cited]]
  - [[#rounding-numbers-to-n-decimals-inemacs-by-gergely-polonkai][Rounding numbers to N decimals in Emacs by Gergely Polonkai]]
  - [[#httpsbloglazkaniiopostsbookmark-with-org-capture][https://blog.lazkani.io/posts/bookmark-with-org-capture/]]
  - [[#httpsorgmodeorgmanualcapture-templateshtml][https://orgmode.org/manual/Capture-templates.html]]
  - [[#doom-emacs-literate-config][DOOM Emacs Literate Config]]
  - [[#alphapapaunpackagedel-a-collection-of-useful-emacs-lisp-code-that-isnt-substantial-enough-to-be-packaged][alphapapa/unpackaged.el: A collection of useful Emacs Lisp code that isn't substantial enough to be packaged]]
  - [[#org-archive-subtree-hierarchicalel-v02][org-archive-subtree-hierarchical.el v0.2]]

* Preamble

Here's the deets:

** Org-mode babel tangle setup

There is a property defined on at the top of this file:

#+begin_example elisp
header-args :tangle yes
#+end_example

This tells Emacs to automatically tangle (include) all code blocks in this file when generating the code for the config file (~config.el~), unless the code block explicitly includes `:tangle no` as the above code block does (or if it is a quote or example block).

** Usage of quote and example blocks
:PROPERTIES:
:ID:       8f9bc104-87a1-4fa4-b624-a5ea64210b8a
:END:

What I am about to explain is typically done in order to debug the configuration on my end. However, the use of quote and example blocks also serves as a way of offering an on/off switch to certain blocks of "settings" (blocks beginning in "#+begin_something" and ending in "#+end_something").

#+begin_quote
#+begin_example
...
#+end_example
#+end_quote

or just delete it entirely if you don't want or need the feature / setting.

I try to keep the ones seen here (as in, in this configuration) limited to settings saved for reference, debugging, or other posterity purposes, rather than leaving behind a bunch of crud and bug fixes that are no longer necessary.

* DOOM Emacs Documentation

#+begin_src elisp
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

Doom exposes five (optional) variables for controlling fonts in Doom. Here are the three important ones:

+ `doom-font'

+ `doom-variable-pitch-font'

+ `doom-big-font' -- used for `doom-big-font-mode'; use this for presentations or streaming.

They all accept either a font-spec, font string ("Input Mono-12"), or xlfd font string. You generally only need these two:

#+begin_example
(setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
#+end_example

#+begin_example
(setq doom-variable-pitch-font (font-spec :family "sans" :size 13))
#+end_example

If you're having issues regarding fonts, you may want to [[id:24408296-5370-4dbf-a52f-f1afe865ceb5][stop Emacs from loading your Xresources file.]]

There are two ways to load a theme. Both assume the theme is installed and available. You can either set `doom-theme' or manually load a theme with the `load-theme' function. This is the default:

#+begin_example elisp
(setq doom-theme 'doom-one)
#+end_example

Here are some additional functions/macros that could help you configure Doom Emacs:

- `load!' for loading external *.el files relative to this one

- `use-package!' for configuring packages

- `after!' for running code after a package has loaded

- `add-load-path!' for adding directories to the `load-path', relative to
  this file. Emacs searches the `load-path' when you load packages with
  `require' or `use-package'.

- `map!' for binding new keys

To get information about any of these functions/macros, move the cursor over the highlighted symbol at press 'K' (non-evil users must press 'C-c c k'). This will open documentation for it, including demos of how they are used.

You can also try 'gd' (or 'C-c c d') to jump to their definition and see how they are implemented.

Place your private configuration here! Remember, you do not need to run 'doom sync' after modifying this file!

Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets.

#+begin_example elisp
(setq user-full-name "John Doe"
      user-mail-address "example@donut.arpa")
#+end_example

* config
** private configuration

#+begin_src elisp
(setq user-full-name "chu the pup"
      user-mail-address "chu@dogboner.xyz")
#+end_src

** abbrev mode

#+begin_src elisp
(add-hook! org-mode :append
           #'abbrev-mode)
#+end_src

** dictionary

#+begin_src elisp
(setq ispell-alternate-dictionary "/usr/share/dict")
#+end_src

** vale

#+begin_src elisp
(add-hook! 'text-mode #'flymake-vale-load)
(add-hook! 'latex-mode-hook #'flymake-vale-load)
(add-hook! 'org-mode #'flymake-vale-load)
(add-hook! 'markdown-mode #'flymake-vale-load)
(add-hook! 'message-mode #'flymake-vale-load)
(use-package! flymake-vale
  :config
  (setq flymake-vale-program "/usr/bin/vale"))
#+end_src

** palimpsest prog mode hook

#+begin_src elisp
(use-package! palimpsest-mode
  :hook (prog-mode . palimpsest-mode))
#+end_src

** vulpea autosync org roam todos from dailies

#+begin_src elisp
(use-package! vulpea
  :hook ((org-roam-db-autosync-mode . vulpea-db-autosync-enable)))
#+end_src

** auth source save behavior

#+begin_src elisp
(setq auth-source-save-behavior nil)
#+end_src

** EMMS

#+begin_src elisp
(setq emms-source-file-directory-tree-function 'emms-source-file-directory-tree-find)
#+end_src

#+begin_src elisp
(setq emms-source-file-default-directory "~/Music/")
#+end_src

** IRC (ERC)

Set user information.

#+begin_src elisp :results none
(setq erc-server "localhost"
      erc-nick "chuthepup"
      erc-user-full-name "Chu the Pup")
#+end_src

** Dired director editor (Emacs file manager) settings :dired:

Have Dired ask to back files up prior to overwriting them.

Make sure you know where your Emacs cache backup directory actually resides before putting this in your init.

#+begin_src elisp
(setq dired-backup-overwrite t)
#+end_src

** Trash instead of delete :dired:
#+begin_src elisp
(setq delete-by-moving-to-trash t)
#+end_src

** Org-Mode
*** org TODO state hiding

Write TODO state changes into LOGBOOK drawer. [[https://stackoverflow.com/a/63798475][Thanks, LeeRuns (stackoverflow.com)]].

#+begin_src elisp
(setq org-log-into-drawer "LOGBOOK")
#+end_src

*** Org Babel Auto-Tangle

For the package org-babel-auto-tangle (see packages.org).

#+begin_src elisp
(add-hook 'org-mode-hook 'org-auto-tangle-mode)
#+end_src

*** Hook load fragtog

#+begin_src elisp
(add-hook 'org-mode-hook 'org-fragtog-mode)
#+end_src

*** Custom org-todo-keywords

#+begin_src elisp
(setq org-todo-keywords
       '((sequence "TODO(t)" "PROJ(p)" "LOOP(r)" "STRT(s)" "WAIT(w)" "HOLD(h)" "HABIT(H)" "IDEA(i)" "|" "DONE(d)" "KILL(k)")
         (sequence "[ ](T)" "[-](S)" "[?](W)" "|" "[X](D)")
         (sequence "|" "OKAY(o)" "YES(y)" "NO(n)")))
#+end_src

*** Ensure blank lines between headings and before contents

Ensure that blank lines exist between headings and between headings and their contents.  With prefix, operate on whole buffer.  Ensures that blank lines exist after each headings's drawers.

For those who prefer to maintain blank lines between headings, this makes it easy to automatically add them where necessary, to a subtree or the whole buffer.  It also adds blank lines after drawers.  Works well with [[*~org-return-dwim~]].

#+BEGIN_SRC elisp
  ;;;###autoload
  (defun unpackaged/org-fix-blank-lines (&optional prefix)
    "Ensure that blank lines exist between headings and between headings and their contents.
  With prefix, operate on whole buffer. Ensures that blank lines
  exist after each headings's drawers."
    (interactive "P")
    (org-map-entries (lambda ()
                       (org-with-wide-buffer
                        ;; `org-map-entries' narrows the buffer, which prevents us from seeing
                        ;; newlines before the current heading, so we do this part widened.
                        (while (not (looking-back "\n\n" nil))
                          ;; Insert blank lines before heading.
                          (insert "\n")))
                       (let ((end (org-entry-end-position)))
                         ;; Insert blank lines before entry content
                         (forward-line)
                         (while (and (org-at-planning-p)
                                     (< (point) (point-max)))
                           ;; Skip planning lines
                           (forward-line))
                         (while (re-search-forward org-drawer-regexp end t)
                           ;; Skip drawers. You might think that `org-at-drawer-p' would suffice, but
                           ;; for some reason it doesn't work correctly when operating on hidden text.
                           ;; This works, taken from `org-agenda-get-some-entry-text'.
                           (re-search-forward "^[ \t]*:END:.*\n?" end t)
                           (goto-char (match-end 0)))
                         (unless (or (= (point) (point-max))
                                     (org-at-heading-p)
                                     (looking-at-p "\n"))
                           (insert "\n"))))
                     t (if prefix
                           nil
                         'tree)))
#+END_SRC

by [[https://github.com/alphapapa/unpackaged.el#ensure-blank-lines-between-headings-and-before-contents][Alphapapa]]

*** Custom org directories and files :org:

If you use `org' and don't want your org files in the default location below, change `org-directory'. It must be set before org loads!

**** Custom org root directory :org:

The following will vary, so change it to be whatever your org root directory is/what you want it to be.

I use a directory that I sync between computers with a nextcloud server I run but you don't necessarily have to do that.

#+begin_src elisp
(after! 'org
  (setq org-directory
        (concat
         (getenv "HOME")
        "/nextcloud/documents/org/")))
#+end_src

