.config/doom/config.org
** Alpha background transparency function :function:

Requires a compositor.

[[https://kristofferbalintona.me/posts/202206071000/][True Emacs Transparency | Kristoffer Balintona]]

#+begin_src elisp
(defun kb/toggle-window-transparency ()
  "Toggle transparency."
  (interactive)
  (let ((alpha-transparency 75))
    (pcase (frame-parameter nil 'alpha-background)
      (alpha-transparency (set-frame-parameter nil 'alpha-background 100))
      (t (set-frame-parameter nil 'alpha-background alpha-transparency)))))
#+end_src

#+begin_src elisp
(defun toggle-transparency ()
  "Toggle transparency."
  (interactive)
  (let ((alpha (frame-parameter nil 'alpha)))
    (if (eq
     (if (numberp alpha)
         alpha
       (cdr alpha)) ; may also be nil
     100)
    (set-frame-parameter nil 'alpha '(85 . 50))
      (set-frame-parameter nil 'alpha '(100 . 100)))))
#+end_src

#+begin_src elisp
(defun toggle-background-transparency ()
  "Toggle background transparency, wherein text and other elements in frame are still displayed but a background isn't."
  (interactive)
  (if (get 'toggle-background-transparency 'state)
      (progn
        (set-frame-parameter nil 'alpha-background 100)
        (put 'toggle-background-transparency 'state nil))
    (progn
      (set-frame-parameter nil 'alpha-background 35)
      (put 'toggle-background-transparency 'state t))))
#+end_src

** Fix alpha transparency issues

Sometimes Emacs has issues with transparency. In my case, it goes unusably transparent if I make use of an Xresources file.

You can specify frames to use different levels of transparency depending on whether or not you have Emacs focused (active) or if you've clicked off to another application (inactive).

#+begin_example elisp
(set-frame-parameter (selected-frame) 'alpha '(<active> . <inactive>))
#+end_example

Or you can just use one number, as so:

#+begin_example elisp
(set-frame-parameter (selected-frame) 'alpha <both>)
#+end_example

Here's the settings I currently use:

#+begin_src elisp
(set-frame-parameter (selected-frame) 'alpha 99) ; set current frame
(add-to-list 'default-frame-alist '(alpha 99)) ; set all frames from this point on
#+end_src

from [[https://www.emacswiki.org/emacs/TransparentEmacs][EmacsWiki: Transparent Emacs]]

You may also wish to [[id:24408296-5370-4dbf-a52f-f1afe865ceb5][disable Emacs loading your Xresources file.]]

** Inhibit Xresources being loaded by Emacs
:PROPERTIES:
:ID:       24408296-5370-4dbf-a52f-f1afe865ceb5
:END:
#+begin_src elisp
(setq inhibit-x-resources t) ; inhibit .xresources file from being loaded on emacs init
#+end_src

** literate calc mode

#+begin_src elisp
(use-package! literate-calc-mode
  :defer t)
#+end_src

** common lisp find file fix for roswell compatibility :lisp:

#+begin_src elisp
(defun +lisp/find-file-in-quicklisp ()
  "Find a file belonging to a library downloaded by Quicklisp."
  (interactive)
  (doom-project-find-file "~/.local/share/roswell/lisp/quicklisp/dists"))
#+end_src

** roswell lisp sly helper :lisp:

#+begin_src elisp
(load! (expand-file-name "~/.local/share/roswell/helper.el"))
(setq inferior-lisp-program "ros -Q run")
#+end_src

** common lisp snippets for yasnippets (require)

#+begin_src elisp
(require 'common-lisp-snippets)
#+end_src
** dired-rsync :rsync:
*** dired-rsync-skip-newer custom rsync function :custom:rsync:
#+begin_src elisp
(defun dired-rsync-skip-newer (dest)
  "Asynchronously copy files in dired to `DEST' using rsync
set to resolve symlinks, skip files that are newer in `DEST',
and to run in archive mode."
  (interactive
   (list (read-file-name "rsync to: " (dired-dwim-target-directory)
                         nil nil nil 'file-directory-p)))
  (let ((dired-rsync-options "-aLuz --info=progress2"))
    (dired-rsync dest)))
#+end_src

#+RESULTS:
: dired-rsync-skip-newer

*** dired-rsync map :binds:custom:rsync:
#+begin_src elisp
(map! "C-c C-d C-r" #'dired-rsync-skip-newer)
#+end_src
* Works Cited
** [[https://gergely.polonkai.eu/blog/2014/10/7/rounding-numbers-to-n-decimals-in-emacs.html][Rounding numbers to N decimals in Emacs]] by Gergely Polonkai
** https://blog.lazkani.io/posts/bookmark-with-org-capture/
** https://orgmode.org/manual/Capture-templates.html
** [[https://raw.githubusercontent.com/gilbertw1/emacs-literate-starter/master/emacs.org][DOOM Emacs Literate Config]]
By Gilbert. Thanks, Gilbert.
** [[https://github.com/alphapapa/unpackaged.el#ensure-blank-lines-between-headings-and-before-contents][alphapapa/unpackaged.el: A collection of useful Emacs Lisp code that isn't substantial enough to be packaged]]
This is where the 'unpackaged/org-fix-blank-lines' function was sourced from.
By alphapapa. Thanks, alphapapa.
** [[https://stackoverflow.com/a/35475878/259187][org-archive-subtree-hierarchical.el v0.2]]
By [[https://gist.github.com/kepi/2f4acc3cc93403c75fbba5684c5d852d][Kepi]]. Thanks, Kepi.
*** [[https://lists.gnu.org/archive/html/emacs-orgmode/2014-08/msg00109.html][org-archive-subtree-hierarchical.el v0.1]]
By [[https://lists.gnu.org/archive/html/emacs-orgmode/2014-08/msg00109.html][Florian Adamsky]]. Thanks, Florian Adamsky.
