.config/doom/config.el

(defun kb/toggle-window-transparency ()
  "Toggle transparency."
  (interactive)
  (let ((alpha-transparency 75))
    (pcase (frame-parameter nil 'alpha-background)
      (alpha-transparency (set-frame-parameter nil 'alpha-background 100))
      (t (set-frame-parameter nil 'alpha-background alpha-transparency)))))

(defun toggle-transparency ()
  "Toggle transparency."
  (interactive)
  (let ((alpha (frame-parameter nil 'alpha)))
    (if (eq
     (if (numberp alpha)
         alpha
       (cdr alpha)) ; may also be nil
     100)
    (set-frame-parameter nil 'alpha '(85 . 50))
      (set-frame-parameter nil 'alpha '(100 . 100)))))

(defun toggle-background-transparency ()
  "Toggle background transparency, wherein text and other elements in frame are still displayed but a background isn't."
  (interactive)
  (if (get 'toggle-background-transparency 'state)
      (progn
        (set-frame-parameter nil 'alpha-background 100)
        (put 'toggle-background-transparency 'state nil))
    (progn
      (set-frame-parameter nil 'alpha-background 35)
      (put 'toggle-background-transparency 'state t))))

(set-frame-parameter (selected-frame) 'alpha 99) ; set current frame
(add-to-list 'default-frame-alist '(alpha 99)) ; set all frames from this point on

(setq inhibit-x-resources t) ; inhibit .xresources file from being loaded on emacs init

(use-package! literate-calc-mode
  :defer t)

(defun +lisp/find-file-in-quicklisp ()
  "Find a file belonging to a library downloaded by Quicklisp."
  (interactive)
  (doom-project-find-file "~/.local/share/roswell/lisp/quicklisp/dists"))

(load! (expand-file-name "~/.local/share/roswell/helper.el"))
(setq inferior-lisp-program "ros -Q run")

(require 'common-lisp-snippets)

(defun dired-rsync-skip-newer (dest)
  "Asynchronously copy files in dired to `DEST' using rsync
set to resolve symlinks, skip files that are newer in `DEST',
and to run in archive mode."
  (interactive
   (list (read-file-name "rsync to: " (dired-dwim-target-directory)
                         nil nil nil 'file-directory-p)))
  (let ((dired-rsync-options "-aLuz --info=progress2"))
    (dired-rsync dest)))

(map! "C-c C-d C-r" #'dired-rsync-skip-newer)
